Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: ولقد صرفناه بينهم ليذكروا فأبى أكثر الناس إلا كفورا
en: And verily We have repeated it among them that they may remember, but most of mankind begrudge aught save ingratitude.

source: ولو شئنا لبعثنا في كل قرية نذيرا
en: If We willed, We could raise up a warner in every village.

source: فلا تطع الكافرين وجاهدهم به جهادا كبيرا
en: So obey not the disbelievers, but strive against them herewith with a great endeavour.

source: وهو الذي مرج البحرين هذا عذب فرات وهذا ملح أجاج وجعل بينهما برزخا وحجرا محجورا
en: And He it is Who hath given independence to the two seas (though they meet); one palatable, sweet, and the other saltish, bitter; and hath set a bar and a forbidding ban between them.

source: وهو الذي خلق من الماء بشرا فجعله نسبا وصهرا وكان ربك قديرا
en: And He it is Who hath created man from water, and hath appointed for him kindred by blood and kindred by marriage; for thy Lord is ever Powerful.

source: ويعبدون من دون الله ما لا ينفعهم ولا يضرهم وكان الكافر على ربه ظهيرا
en: Yet they worship instead of Allah that which can neither benefit them nor hurt them. The disbeliever was ever a partisan against his Lord.

source: وما أرسلناك إلا مبشرا ونذيرا
en: And We have sent thee (O Muhammad) only as a bearer of good tidings and a warner.

source: قل ما أسألكم عليه من أجر إلا من شاء أن يتخذ إلى ربه سبيلا
en: Say: I ask of you no reward for this, save that whoso will may choose a way unto his Lord.

source: وتوكل على الحي الذي لا يموت وسبح بحمده وكفى به بذنوب عباده خبيرا
en: And trust thou in the Living One Who dieth not, and hymn His praise. He sufficeth as the Knower of His bondmen's sins,

source: الذي خلق السماوات والأرض وما بينهما في ستة أيام ثم استوى على العرش الرحمن فاسأل به خبيرا
en: Who created the heavens and the earth and all that is between them in six Days, then He mounted the Throne. The Beneficent! Ask anyone informed concerning Him!

source: وإذا قيل لهم اسجدوا للرحمن قالوا وما الرحمن أنسجد لما تأمرنا وزادهم نفورا
en: And when it is said unto them: Prostrate to the Beneficent! they say: And what is the Beneficent? Are we to prostrate to whatever thou (Muhammad) biddest us? And it increaseth aversion in them.

source: تبارك الذي جعل في السماء بروجا وجعل فيها سراجا وقمرا منيرا
en: Blessed be He Who hath placed in the heaven mansions of the stars, and hath placed therein a great lamp and a moon giving light!

source: وهو الذي جعل الليل والنهار خلفة لمن أراد أن يذكر أو أراد شكورا
en: And He it is Who hath appointed night and day in succession, for him who desireth to remember, or desireth thankfulness.

source: وعباد الرحمن الذين يمشون على الأرض هونا وإذا خاطبهم الجاهلون قالوا سلاما
en: The (faithful) slaves of the Beneficent are they who walk upon the earth modestly, and when the foolish ones address them answer: Peace;

source: والذين يبيتون لربهم سجدا وقياما
en: And who spend the night before their Lord, prostrate and standing,

source: والذين يقولون ربنا اصرف عنا عذاب جهنم إن عذابها كان غراما
en: And who say: Our Lord! Avert from us the doom of hell; lo! the doom thereof is anguish;

source: إنها ساءت مستقرا ومقاما
en: Lo! it is wretched as abode and station;

source: والذين إذا أنفقوا لم يسرفوا ولم يقتروا وكان بين ذلك قواما
en: And those who, when they spend, are neither prodigal nor grudging; and there is ever a firm station between the two;

source: والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون ومن يفعل ذلك يلق أثاما
en: And those who cry not unto any other god along with Allah, nor take the life which Allah hath forbidden save in (course of) justice, nor commit adultery - and whoso doeth this shall pay the penalty;

source: يضاعف له العذاب يوم القيامة ويخلد فيه مهانا
en: The doom will be doubled for him on the Day of Resurrection, and he will abide therein disdained for ever;

source: إلا من تاب وآمن وعمل عملا صالحا فأولئك يبدل الله سيئاتهم حسنات وكان الله غفورا رحيما
en: Save him who repenteth and believeth and doth righteous work; as for such, Allah will change their evil deeds to good deeds. Allah is ever Forgiving, Merciful.

source: ومن تاب وعمل صالحا فإنه يتوب إلى الله متابا
en: And whosoever repenteth and doeth good, he verily repenteth toward Allah with true repentance -

source: والذين لا يشهدون الزور وإذا مروا باللغو مروا كراما
en: And those who will not witness vanity, but when they pass near senseless play, pass by with dignity.

source: والذين إذا ذكروا بآيات ربهم لم يخروا عليها صما وعميانا
en: And those who, when they are reminded of the revelations of their Lord, fall not deaf and blind thereat.

source: والذين يقولون ربنا هب لنا من أزواجنا وذرياتنا قرة أعين واجعلنا للمتقين إماما
en: And who say: Our Lord! Vouchsafe us comfort of our wives and of our offspring, and make us patterns for (all) those who ward off (evil).

source: أولئك يجزون الغرفة بما صبروا ويلقون فيها تحية وسلاما
en: They will be awarded the high place forasmuch as they were steadfast, and they will meet therein with welcome and the ward of peace,

source: خالدين فيها حسنت مستقرا ومقاما
en: Abiding there for ever. Happy is it as abode and station!

source: قل ما يعبأ بكم ربي لولا دعاؤكم فقد كذبتم فسوف يكون لزاما
en: Say (O Muhammad, unto the disbelievers): My Lord would not concern Himself with you but for your prayer. But now ye have denied (the Truth), therefor there will be judgment.

source: طسم
en: Ta. Sin. Mim.

source: تلك آيات الكتاب المبين
en: These are revelations of the Scripture that maketh plain.

source: لعلك باخع نفسك ألا يكونوا مؤمنين
en: It may be that thou tormentest thyself (O Muhammad) because they believe not.

source: إن نشأ ننزل عليهم من السماء آية فظلت أعناقهم لها خاضعين
en: If We will, We can send down on them from the sky a portent so that their necks would remain bowed before it.

source: وما يأتيهم من ذكر من الرحمن محدث إلا كانوا عنه معرضين
en: Never cometh there unto them a fresh reminder from the Beneficent One, but they turn away from it.

source: فقد كذبوا فسيأتيهم أنباء ما كانوا به يستهزئون
en: Now they have denied (the Truth); but there will come unto them tidings of that whereat they used to scoff.

source: أولم يروا إلى الأرض كم أنبتنا فيها من كل زوج كريم
en: Have they not seen the earth, how much of every fruitful kind We make to grow therein?

source: إن في ذلك لآية وما كان أكثرهم مؤمنين
en: Lo! herein is indeed a portent; yet most of them are not believers.

source: وإن ربك لهو العزيز الرحيم
en: And lo! thy Lord! He is indeed the Mighty, the Merciful.

source: وإذ نادى ربك موسى أن ائت القوم الظالمين
en: And when thy Lord called Moses, saying: Go unto the wrongdoing folk,

source: قوم فرعون ألا يتقون
en: The folk of Pharaoh. Will they not ward off (evil)?

source: قال رب إني أخاف أن يكذبون
en: He said: My Lord! Lo! I fear that they will deny me,

source: ويضيق صدري ولا ينطلق لساني فأرسل إلى هارون
en: And I shall be embarrassed, and my tongue will not speak plainly, therefor send for Aaron (to help me).

source: ولهم علي ذنب فأخاف أن يقتلون
en: And they have a crime against me, so I fear that they will kill me.

source: قال كلا فاذهبا بآياتنا إنا معكم مستمعون
en: He said: Nay, verily. So go ye twain with Our tokens. Lo! We shall be with you, Hearing.

source: فأتيا فرعون فقولا إنا رسول رب العالمين
en: And come together unto Pharaoh and say: Lo! we bear a message of the Lord of the Worlds,

source: أن أرسل معنا بني إسرائيل
en: (Saying): Let the Children of Israel go with us.

source: قال ألم نربك فينا وليدا ولبثت فينا من عمرك سنين
en: (Pharaoh) said (unto Moses): Did we not rear thee among us as a child? And thou didst dwell many years of thy life among us,

source: وفعلت فعلتك التي فعلت وأنت من الكافرين
en: And thou didst that thy deed which thou didst, and thou wast one of the ingrates.

source: قال فعلتها إذا وأنا من الضالين
en: He said: I did it then, when I was of those who are astray.

source: ففررت منكم لما خفتكم فوهب لي ربي حكما وجعلني من المرسلين
en: Then I fled from you when I feared you, and my Lord vouchsafed me a command and appointed me (of the number) of those sent (by Him).

source: وتلك نعمة تمنها علي أن عبدت بني إسرائيل
en: And this is the past favour wherewith thou reproachest me: that thou hast enslaved the Children of Israel.

source: قال فرعون وما رب العالمين
en: Pharaoh said: And what is the Lord of the Worlds?

source: قال رب السماوات والأرض وما بينهما إن كنتم موقنين
en: (Moses) said: Lord of the heavens and the earth and all that is between them, if ye had but sure belief.

source: قال لمن حوله ألا تستمعون
en: (Pharaoh) said unto those around him: Hear ye not?

source: قال ربكم ورب آبائكم الأولين
en: He said: Your Lord and the Lord of your fathers.

source: قال إن رسولكم الذي أرسل إليكم لمجنون
en: (Pharaoh) said: Lo! your messenger who hath been sent unto you is indeed a madman!

source: قال رب المشرق والمغرب وما بينهما إن كنتم تعقلون
en: He said: Lord of the East and the West and all that is between them, if ye did but understand.

source: قال لئن اتخذت إلها غيري لأجعلنك من المسجونين
en: (Pharaoh) said: If thou choosest a god other than me, I assuredly shall place thee among the prisoners.

source: قال أولو جئتك بشيء مبين
en: He said: Even though I show thee something plain?

source: قال فأت به إن كنت من الصادقين
en: (Pharaoh) said: Produce it then, if thou art of the truthful!

source: قال للملإ حوله إن هذا لساحر عليم
en: (Pharaoh) said unto the chiefs about him: Lo! this is verily a knowing wizard,

source: يريد أن يخرجكم من أرضكم بسحره فماذا تأمرون
en: Who would drive you out of your land by his magic. Now what counsel ye?

source: قالوا أرجه وأخاه وابعث في المدائن حاشرين
en: They said: Put him off, (him) and his brother, and send into the cities summoners

source: يأتوك بكل سحار عليم
en: Who shall bring unto thee every knowing wizard.

source: فجمع السحرة لميقات يوم معلوم
en: So the wizards were gathered together at a set time on a day appointed.

source: وقيل للناس هل أنتم مجتمعون
en: And it was said unto the people: Are ye (also) gathering?

source: لعلنا نتبع السحرة إن كانوا هم الغالبين
en: (They said): Aye, so that we may follow the wizards if they are the winners.

source: فلما جاء السحرة قالوا لفرعون أئن لنا لأجرا إن كنا نحن الغالبين
en: And when the wizards came they said unto Pharaoh: Will there surely be a reward for us if we are the winners?

source: قال نعم وإنكم إذا لمن المقربين
en: He said: Aye, and ye will then surely be of those brought near (to me).

source: قال لهم موسى ألقوا ما أنتم ملقون
en: Moses said unto them: Throw what ye are going to throw!

source: فألقوا حبالهم وعصيهم وقالوا بعزة فرعون إنا لنحن الغالبون
en: Then they threw down their cords and their staves and said: By Pharaoh's might, lo! we verily are the winners.

source: فألقى موسى عصاه فإذا هي تلقف ما يأفكون
en: Then Moses threw his staff and lo! it swallowed that which they did falsely show.

source: فألقي السحرة ساجدين
en: And the wizards were flung prostrate,

source: قال آمنتم له قبل أن آذن لكم إنه لكبيركم الذي علمكم السحر فلسوف تعلمون لأقطعن أيديكم وأرجلكم من خلاف ولأصلبنكم أجمعين
en: (Pharaoh) said: Ye put your faith in him before I give you leave. Lo! he doubtless is your chief who taught you magic! But verily ye shall come to know. Verily I will cut off your hands and your feet alternately, and verily I will crucify you every one.

source: قالوا لا ضير إنا إلى ربنا منقلبون
en: They said: It is no hurt, for lo! unto our Lord we shall return.

source: إنا نطمع أن يغفر لنا ربنا خطايانا أن كنا أول المؤمنين
en: Lo! we ardently hope that our Lord will forgive us our sins because we are the first of the believers.

source: وأوحينا إلى موسى أن أسر بعبادي إنكم متبعون
en: And We inspired Moses, saying: Take away My slaves by night, for ye will be pursued.

source: فأرسل فرعون في المدائن حاشرين
en: Then Pharaoh sent into the cities summoners,

source: إن هؤلاء لشرذمة قليلون
en: (Who said): Lo! these indeed are but a little troop,

source: وإنهم لنا لغائظون
en: And lo! they are offenders against us.

source: وإنا لجميع حاذرون
en: And lo! we are a ready host.

source: فأخرجناهم من جنات وعيون
en: Thus did We take them away from gardens and watersprings,

source: وكنوز ومقام كريم
en: And treasures and a fair estate.

source: كذلك وأورثناها بني إسرائيل
en: Thus (were those things taken from them) and We caused the Children of Israel to inherit them.

source: فأتبعوهم مشرقين
en: And they overtook them at sunrise.

source: فلما تراءى الجمعان قال أصحاب موسى إنا لمدركون
en: And when the two hosts saw each other, those with Moses said: Lo! we are indeed caught.

source: قال كلا إن معي ربي سيهدين
en: He said: Nay, verily! for lo! my Lord is with me. He will guide me.

source: فأوحينا إلى موسى أن اضرب بعصاك البحر فانفلق فكان كل فرق كالطود العظيم
en: Then We inspired Moses, saying: Smite the sea with thy staff. And it parted, and each part was as a mountain vast.

source: وأزلفنا ثم الآخرين
en: Then brought We near the others to that place.

source: وأنجينا موسى ومن معه أجمعين
en: And We saved Moses and those with him, every one;

source: ثم أغرقنا الآخرين
en: And We drowned the others.

source: واتل عليهم نبأ إبراهيم
en: Recite unto them the story of Abraham:

source: إذ قال لأبيه وقومه ما تعبدون
en: When he said unto his father and his folk: What worship ye?

source: قالوا نعبد أصناما فنظل لها عاكفين
en: They said: We worship idols, and are ever devoted unto them.

source: قال هل يسمعونكم إذ تدعون
en: He said: Do they hear you when ye cry?

source: أو ينفعونكم أو يضرون
en: Or do they benefit or harm you?

source: قالوا بل وجدنا آباءنا كذلك يفعلون
en: They said: Nay, but we found our fathers acting on this wise.

source: قال أفرأيتم ما كنتم تعبدون
en: He said: See now that which ye worship,

source: أنتم وآباؤكم الأقدمون
en: Ye and your forefathers!

source: فإنهم عدو لي إلا رب العالمين
en: Lo! they are (all) an enemy unto me, save the Lord of the Worlds,

source: الذي خلقني فهو يهدين
en: Who created me, and He doth guide me,

source: والذي هو يطعمني ويسقين
en: And Who feedeth me and watereth me.

source: وإذا مرضت فهو يشفين
en: And when I sicken, then He healeth me,

source: والذي يميتني ثم يحيين
en: And Who causeth me to die, then giveth me life (again),

source: والذي أطمع أن يغفر لي خطيئتي يوم الدين
en: And Who, I ardently hope, will forgive me my sin on the Day of Judgment.

source: رب هب لي حكما وألحقني بالصالحين
en: My Lord! Vouchsafe me wisdom and unite me to the righteous.

source: واجعل لي لسان صدق في الآخرين
en: And give unto me a good report in later generations.

source: واجعلني من ورثة جنة النعيم
en: And place me among the inheritors of the Garden of Delight,

source: واغفر لأبي إنه كان من الضالين
en: And forgive my father. Lo! he is of those who err.

source: ولا تخزني يوم يبعثون
en: And abase me not on the day when they are raised,

source: يوم لا ينفع مال ولا بنون
en: The day when wealth and sons avail not (any man)

source: إلا من أتى الله بقلب سليم
en: Save him who bringeth unto Allah a whole heart.

source: وأزلفت الجنة للمتقين
en: And the Garden will be brought nigh for those who ward off (evil).

source: وبرزت الجحيم للغاوين
en: And hell will appear plainly to the erring.

source: وقيل لهم أين ما كنتم تعبدون
en: And it will be said unto them: Where is (all) that ye used to worship

source: من دون الله هل ينصرونكم أو ينتصرون
en: Instead of Allah? Can they help you or help themselves?

source: فكبكبوا فيها هم والغاوون
en: Then will they be hurled therein, they and the seducers

source: وجنود إبليس أجمعون
en: And the hosts of Iblis, together.

source: قالوا وهم فيها يختصمون
en: And they will say, when they are quarrelling therein:

source: تالله إن كنا لفي ضلال مبين
en: By Allah, of a truth we were in error manifest

source: إذ نسويكم برب العالمين
en: When we made you equal with the Lord of the Worlds.

source: وما أضلنا إلا المجرمون
en: It was but the guilty who misled us.

source: فما لنا من شافعين
en: Now we have no intercessors

source: ولا صديق حميم
en: Nor any loving friend.

source: فلو أن لنا كرة فنكون من المؤمنين
en: Oh, that we had another turn (on earth), that we might be of the believers!

source: كذبت قوم نوح المرسلين
en: Noah's folk denied the messengers (of Allah),

source: إذ قال لهم أخوهم نوح ألا تتقون
en: When their brother Noah said unto them: Will ye not ward off (evil)?

source: إني لكم رسول أمين
en: Lo! I am a faithful messenger unto you,

source: فاتقوا الله وأطيعون
en: So keep your duty to Allah, and obey me.

source: وما أسألكم عليه من أجر إن أجري إلا على رب العالمين
en: And I ask of you no wage therefor; my wage is the concern only of the Lord of the Worlds.

source: قالوا أنؤمن لك واتبعك الأرذلون
en: They said: Shall we put faith in thee, when the lowest (of the people) follow thee?

source: قال وما علمي بما كانوا يعملون
en: He said: And what knowledge have I of what they may have been doing (in the past)?

source: إن حسابهم إلا على ربي لو تشعرون
en: Lo! their reckoning is my Lord's concern, if ye but knew;

source: وما أنا بطارد المؤمنين
en: And I am not (here) to repulse believers.

source: إن أنا إلا نذير مبين
en: I am only a plain warner.

source: قالوا لئن لم تنته يا نوح لتكونن من المرجومين
en: They said: If thou cease not, O Noah, thou wilt surely be among those stoned (to death).

source: قال رب إن قومي كذبون
en: He said: My Lord! Lo! my own folk deny me.

source: فافتح بيني وبينهم فتحا ونجني ومن معي من المؤمنين
en: Therefor judge Thou between us, a (conclusive) judgment, and save me and those believers who are with me.

source: فأنجيناه ومن معه في الفلك المشحون
en: And We saved him and those with him in the laden ship.

source: ثم أغرقنا بعد الباقين
en: Then afterward We drowned the others.

source: كذبت عاد المرسلين
en: (The tribe of) A'ad denied the messengers (of Allah).

source: إذ قال لهم أخوهم هود ألا تتقون
en: When their brother Hud said unto them: Will ye not ward off (evil)?

source: أتبنون بكل ريع آية تعبثون
en: Build ye on every high place a monument for vain delight?

source: وتتخذون مصانع لعلكم تخلدون
en: And seek ye out strongholds, that haply ye may last for ever?

source: وإذا بطشتم بطشتم جبارين
en: And if ye seize by force, seize ye as tyrants?

source: واتقوا الذي أمدكم بما تعلمون
en: Keep your duty toward Him Who hath aided you with (the good things) that ye know,

source: أمدكم بأنعام وبنين
en: Hath aided you with cattle and sons.

source: وجنات وعيون
en: And gardens and watersprings.

source: إني أخاف عليكم عذاب يوم عظيم
en: Lo! I fear for you the retribution of an awful day.

source: قالوا سواء علينا أوعظت أم لم تكن من الواعظين
en: They said: It is all one to us whether thou preachest or art not of those who preach;

source: إن هذا إلا خلق الأولين
en: This is but a fable of the men of old,

source: وما نحن بمعذبين
en: And we shall not be doomed.

source: فكذبوه فأهلكناهم إن في ذلك لآية وما كان أكثرهم مؤمنين
en: And they denied him; therefor We destroyed them. Lo! herein is indeed a portent, yet most of them are not believers.

source: كذبت ثمود المرسلين
en: (The tribe of) Thamud denied the messengers (of Allah)

source: إذ قال لهم أخوهم صالح ألا تتقون
en: When their brother Salih said unto them: Will ye not ward off (evil)?

source: أتتركون في ما هاهنا آمنين
en: Will ye be left secure in that which is here before us,

source: في جنات وعيون
en: In gardens and watersprings.

source: وزروع ونخل طلعها هضيم
en: And tilled fields and heavy-sheathed palm-trees,

source: وتنحتون من الجبال بيوتا فارهين
en: Though ye hew out dwellings in the mountain, being skilful?

source: ولا تطيعوا أمر المسرفين
en: And obey not the command of the prodigal,

source: الذين يفسدون في الأرض ولا يصلحون
en: Who spread corruption in the earth, and reform not.

source: قالوا إنما أنت من المسحرين
en: They said: Thou art but one of the bewitched;

source: ما أنت إلا بشر مثلنا فأت بآية إن كنت من الصادقين
en: Thou art but a mortal like us. So bring some token if thou art of the truthful.

source: قال هذه ناقة لها شرب ولكم شرب يوم معلوم
en: He said: (Behold) this she-camel. She hath the right to drink (at the well), and ye have the right to drink, (each) on an appointed day.

source: ولا تمسوها بسوء فيأخذكم عذاب يوم عظيم
en: And touch her not with ill lest there come on you the retribution of an awful day.

source: فعقروها فأصبحوا نادمين
en: But they hamstrung her, and then were penitent.

source: فأخذهم العذاب إن في ذلك لآية وما كان أكثرهم مؤمنين
en: So the retribution came on them. Lo! herein is indeed a portent, yet most of them are not believers.

source: كذبت قوم لوط المرسلين
en: The folk of Lot denied the messengers (of Allah),

source: إذ قال لهم أخوهم لوط ألا تتقون
en: When their brother Lot said unto them: Will ye not ward off (evil)?

source: أتأتون الذكران من العالمين
en: What! Of all creatures do ye come unto the males,

source: وتذرون ما خلق لكم ربكم من أزواجكم بل أنتم قوم عادون
en: And leave the wives your Lord created for you? Nay, but ye are froward folk.

source: قالوا لئن لم تنته يا لوط لتكونن من المخرجين
en: They said: If thou cease not, O Lot, thou wilt soon be of the outcast.

source: قال إني لعملكم من القالين
en: He said: I am in truth of those who hate your conduct.

source: رب نجني وأهلي مما يعملون
en: My Lord! Save me and my household from what they do.

source: فنجيناه وأهله أجمعين
en: So We saved him and his household, every one,

source: إلا عجوزا في الغابرين
en: Save an old woman among those who stayed behind.

source: ثم دمرنا الآخرين
en: Then afterward We destroyed the others.

source: وأمطرنا عليهم مطرا فساء مطر المنذرين
en: And We rained on them a rain. And dreadful is the rain of those who have been warned.

source: كذب أصحاب الأيكة المرسلين
en: The dwellers in the wood (of Midian) denied the messengers (of Allah),

source: إذ قال لهم شعيب ألا تتقون
en: When Shu'eyb said unto them: Will ye not ward off (evil)?

source: أوفوا الكيل ولا تكونوا من المخسرين
en: Give full measure, and be not of those who give less (than the due).

source: وزنوا بالقسطاس المستقيم
en: And weigh with the true balance.

source: ولا تبخسوا الناس أشياءهم ولا تعثوا في الأرض مفسدين
en: Wrong not mankind in their goods, and do not evil, making mischief, in the earth.

source: واتقوا الذي خلقكم والجبلة الأولين
en: And keep your duty unto Him Who created you and the generations of the men of old.

source: وما أنت إلا بشر مثلنا وإن نظنك لمن الكاذبين
en: Thou art but a mortal like us, and lo! we deem thee of the liars.

source: فأسقط علينا كسفا من السماء إن كنت من الصادقين
en: Then make fragments of the heaven fall upon us, if thou art of the truthful.

source: قال ربي أعلم بما تعملون
en: He said: My Lord is Best Aware of what ye do.

source: فكذبوه فأخذهم عذاب يوم الظلة إنه كان عذاب يوم عظيم
en: But they denied him, so there came on them the retribution of the day of gloom. Lo! it was the retribution of an awful day.

source: وإنه لتنزيل رب العالمين
en: And lo! it is a revelation of the Lord of the Worlds,

source: نزل به الروح الأمين
en: Which the True Spirit hath brought down

source: على قلبك لتكون من المنذرين
en: Upon thy heart, that thou mayst be (one) of the warners,

source: بلسان عربي مبين
en: In plain Arabic speech.

source: وإنه لفي زبر الأولين
en: And lo! it is in the Scriptures of the men of old.

source: أولم يكن لهم آية أن يعلمه علماء بني إسرائيل
en: Is it not a token for them that the doctors of the Children of Israel know it?

source: ولو نزلناه على بعض الأعجمين
en: And if We had revealed it unto one of any other nation than the Arabs,

source: فقرأه عليهم ما كانوا به مؤمنين
en: And he had read it unto them, they would not have believed in it.

source: كذلك سلكناه في قلوب المجرمين
en: Thus do We make it traverse the hearts of the guilty.

source: لا يؤمنون به حتى يروا العذاب الأليم
en: They will not believe in it till they behold the painful doom,

source: فيأتيهم بغتة وهم لا يشعرون
en: So that it will come upon them suddenly, when they perceive not.

source: فيقولوا هل نحن منظرون
en: Then they will say: Are we to be reprieved?
